run/temp_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
(-10000 -400 0) 
(10000 -400 0) 
(10000 3000 0) 
(-10000 3000 0) 
(-10000 -400 300) 
(10000 -400 300) 
(10000 3000 300) 
(-10000 3000 300) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 60 1) simpleGrading (1 1 1) 
);



edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    side
    {
        type patch;
        faces
        (
            (2 6 5 1)
            (0 4 7 3)
        );
    }
    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
    back
    {
        type empty;
        faces
        (
            (1 0 3 2)
        );
    }

);

// ************************************************************************* //
