run/temp_template/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection off;

    interpolationSchemes
    {
        rho         cell;
        Umix        cellPoint;
        mu          cell;
        DUcDt       cell;
    }

    integrationSchemes
    {
        U            Euler;
    }

    sourceTerms
    {
        schemes
        {
            U semiImplicit 1;
        }
    }
}

constantProperties
{
    parcelTypeId 1;

    rhoMin          1e-15;
    minParcelMass   1e-15;

    rho0            2300;
    youngsModulus   1e8;
    poissonsRatio   0.35;

    constantVolume  false;

    alphaMax        0.99;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
        virtualMass
        {
            Cvm        0.5;
        };
        pressureGradient
        {
            U   U; 
        };
        /*
		virtualMass 
		PlessisMasliyahDrag
		SRF
		SaffmanMeiLiftForce
		TomiyamaLift
		WenYuDrag
		nonInertialFrame
		nonSphereDrag
		paramagnetic
		sphereDrag
	*/
    }


    dispersionModel none;

    patchInteractionModel none;

    localInteractionCoeffs
    {
        patches
        (
            atm
            {
                type rebound;
                e    0.97;
                mu   0.09;
            }
            crater
            {
                type stick;
                e    0.97;
                mu   0.09;
            }
            terrain
            {
                type stick;
                e    0.0;
                mu   1.0;
            }
            top
            {
                type rebound;
                e    0.97;
                mu   0.09;
            }
        );
    }

    StandardWallInteractionCoeffs
    {
        type rebound;
        e    0.97;
        mu   0.09;
    }

    heatTransferModel none;

    surfaceFilmModel none;

    collisionModel none;

    pairCollisionCoeffs
    {
        maxInteractionDistance  0.0025;

        writeReferredParticleCloud no;

        pairModel pairSpringSliderDashpot;

        pairSpringSliderDashpotCoeffs
        {
            useEquivalentSize   no;
            alpha               0.02;
            b                   1.5;
            mu                  0.10;
            cohesionEnergyDensity 0;
            collisionResolutionSteps 12;
        };

        wallModel wallSpringSliderDashpot;

        wallSpringSliderDashpotCoeffs
        {
            useEquivalentSize no;
            collisionResolutionSteps 12;
            youngsModulus   1e8;
            poissonsRatio   0.23;
            alpha           0.01;
            b               1.5;
            mu              0.09;
            cohesionEnergyDensity 0;
        };

        U     U.air;
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{}


// ************************************************************************* //
