run/temp_template/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    front 
    {
        inGroups         1  (frontAndBack);
    }
    back
    {
        inGroups         1  (frontAndBack);
    }
    nozzel
    {
      inGroups           1 (allFaces);
    }
    groundAndWall
    {
      inGroups           1 (allFaces);
    }  
    top
    {
        inGroups	    (outOrIn allFaces);
    }
    side	
    {
        inGroups	    (outOrIn allFaces);
    }
    inlet
      {
	inGroups          1  (allFaces);
      }	

// ************************************************************************* //
